def binar_search(nums, target): 
    """ 
    Сложность поиска : O(log n), сложность именно такая по причине того,
    что при каждом сравнении сравниваются два числа,если нужное число меньше серединного,
    то строка,в которой ведется поиск сокращается примерно вдвое,при последующих иттерациях происходит то же самое,
    пока не найдется нужное число и вот количество таких иттераций это количество того,сколько раз можно поделить n на 2,т.е. log (n) - бинарный логарифм
    """
    low = 0
    high = len(nums) - 1
    while low <= high:
        mid = (low + high) // 2
        if nums[mid] < target:
            low = mid + 1
        elif nums[mid] > target:
            high = mid - 1
        else:
            return mid

    return -1
example = list(range(20,50))
print(f" Индекс элемента: {binar_search(example, 35)}")